Mahmoudg02/Learn_in_Depth/STM32F103_Drivers/MCAL/I2C/Src/STM32F103_I2C.c

/**********************************************************************************************************************
 *  FILE DESCRIPTION
 *  -------------------------------------------------------------------------------------------------------------------
 *         File:  SPI.c
 *       Author:  MAshr
 *   	   Date:  22 Nov 2022
 *       Module:
 *		  Brief:
 *  Description:  <Write File DESCRIPTION here>
 *
 *********************************************************************************************************************/

/**********************************************************************************************************************
 *  INCLUDES
 *********************************************************************************************************************/
#include "STM32F103_I2C.h"


/**********************************************************************************************************************
 *  LOCAL MACROS CONSTANT\FUNCTION
 *********************************************************************************************************************/

#define I2C1_Index				0
#define I2C2_Index				1


/**********************************************************************************************************************
 *  LOCAL DATA
 *********************************************************************************************************************/
I2C_Config_t G_I2C_Config[2] = {0};
/**********************************************************************************************************************
 *  GLOBAL DATA
 *********************************************************************************************************************/

/**********************************************************************************************************************
 *  LOCAL FUNCTION PROTOTYPES
 *********************************************************************************************************************/

/**********************************************************************************************************************
 *  LOCAL FUNCTIONS
 *********************************************************************************************************************/

/**********************************************************************************************************************
 *  GLOBAL FUNCTIONS
 *********************************************************************************************************************/


/* ================================================================
 * @Fn 				- MCAL_I2C_Init
 * @brief 			- Initializes I2Cx according to the specified parameters in I2C_Config
 * @param [in] 		- I2Cx : where x can be (1..2 depending on device used) to select I2C peripheral
 * @param [in] 		- I2C_Config : a pointer to I2C_Config_t structure that contains the configuration information for the specified I2C Module
 * @retval 			- None
 * Note 			- Supported for I2C SM mode only
 * 					- Support only 7-bit address mode
 */
void MCAL_I2C_Init(I2C_REG_t *I2Cx, I2C_Config_t *I2C_Config)
{
	uint16_t Temp_Register = 0 , Freq_Range = 0;
	uint32_t Pclk1 = 8000000;
	uint16_t Result = 0;

	/* 1. Enable the RCC Clock */
	if(I2Cx == I2C1)
	{
		/* If I2C1 Put all configurations in the global configuration */
		G_I2C_Config[I2C1_Index] = *I2C_Config;

		/* Open the I2C1 RCC Clock */
		RCC_I2C1_CLK_EN();
	}
	else if(I2Cx == I2C2)
	{
		/* If I2C2 Put all configurations in the global configuration */
		G_I2C_Config[I2C2_Index] = *I2C_Config;

		/* Open the I2C2 RCC Clock */
		RCC_I2C2_CLK_EN();
	}

	/* 2. Set I2C Mode */
	if(I2C_Config->Mode == I2C_MODE_I2C_MODE)
	{
		/* =================== Initialize Timing ==================== */
		/*
		 * --- I2C_CR2 -> Bits 5:0 FREQ[5:0]: Peripheral clock frequency
		 */
		/* 1. Get the I2Cx "CR2" Control register 2 Value */
		Temp_Register = I2Cx->CR2;

		/* 2. Clear frequency -> FREQ[5:0] bits */
		Temp_Register &= ~(I2C_CR2_FREQ_Msk); // (0x3FUL << 0)

		/* 3. Get Pclk1 frequency value */
		Pclk1 = MCAL_RCC_GetFreq_PCLK1();

		/* 4. Set frequency bits depending in Pclk1 value */
		Freq_Range = (uint16_t)(Pclk1);

		/* 5. Move the configuration in the temp register to set it in the CR2 register */
		Temp_Register |= Freq_Range;

		/* 6. Set the "CR2" register with our new value */
		I2Cx->CR2 = Temp_Register;

		//---------------------------------------------------------------------------------------------------------
		/* ========= Configure "I2C_CCR" Clock control register ========= */

		/* 7. Disable the selected I2C peripheral to configure time */
		I2Cx->CR1 &= ~(I2C_CR1_PE);

		/* 8. Put the temp register with zero ready to put data on it */
		Temp_Register = 0;

		/* 9. Configure the speed in the standard mode / Fast Mode */
		if((I2C_Config->Clock_Speed == I2C_CLOCK_SPEED_50KHZ)||(I2C_Config->Clock_Speed == I2C_CLOCK_SPEED_100KHZ))
		{
			/* 10. Enable standard mode but its zero as default */

			/* 11. Put the standard mode calculation */
			/*
			 * Tclk / 2 = CCR * Tpclk1
			 * CCR = Tclk / (2 * Tpclk1)
			 * CCR = Fpclk / (2 * I2C_ClockFrequency)
			 */
			Result = (uint16_t)((Pclk1*1000000)/(I2C_Config->Clock_Speed << 1));

			/* 12. Move the configuration in the temp register to set it in the I2C_CCR register */
			Temp_Register |= Result;

			/* 13. Set the "I2C_CCR" register with our new value */
			I2Cx->CCR = Temp_Register;

			/* ========= Configure "I2C_TRISE" Rise time register ============ */
			/*
			 * For instance: in Sm mode, the maximum allowed SCL rise time is 1000 ns.
			 * If, in the I2C_CR2 register, the value of FREQ[5:0] bits is equal to 0x08 and TPCLK1 = 125 ns
			 * therefore the TRISE[5:0] bits must be programmed with 09h.
			 * (1000 ns / 125 ns = 8 + 1)
			 */
			/* 14. Set the "I2C_TRISE" register with "Frequency Range + 1" as data sheet */

			I2Cx->TRISE = Freq_Range + 1;
		}
		else
		{
			/* Fast Mode not supported */
		}

		/* =================== End Timing Initialization  ==================== */

		/* ========================================================================================== */
		/* ========= Configure "I2C_CR1" Control register 1 ========= */

		/* 1. Get the I2C CR1 value */
		Temp_Register = I2Cx->CR1;

		/* 2. Set All configuration to the temp register  */
		Temp_Register |= (uint16_t)(I2C_Config->ACK_Control | I2C_Config->General_Call | I2C_Config->Mode | I2C_Config->Stretch_Mode);

		/* 3. Set the "I2C_CR1" register with our new value */
		I2Cx->CR1 = Temp_Register;

		/* ========================================================================================== */

		/* ========= Configure "I2C_OAR" Own address registers ========= */

		/* 1. Put the temp register with zero ready to put data on it */
		Temp_Register = 0;

		/* 2. Check the Slave_Address type & Configure depends on it */
		if(I2C_Config->Slave_Address.Enable_Dual_Address == 1)
		{
			/* 1. Enable the Dual addressing mode */
			Temp_Register = I2C_OAR2_ENDUAL;

			/* 2. Put the input Second address form the user to the register */
			/*
			 * Bits 7:1 ADD2[7:1]: Interface address
			 * 		bits 7:1 of address in dual addressing mode
			 */
			Temp_Register |= I2C_Config->Slave_Address.Slave_Second_Address << I2C_OAR2_ADD2_Pos; // Shifting with the first bit in the register

			/* 3. Set the "I2C_OAR2" register with our new value */
			I2Cx->OAR2 = Temp_Register;
		}

