Mahmoudg02/Learn_in_Depth/STM32F103_Drivers/MCAL/I2C/Src/STM32F103_I2C.c
	/* 6. Check if there is Data length available */
	if(Data_Length)
	{
		/* 7. Loop inside the data to read it till length become zero */
		for (i = Data_Length; i > 1 ; i--)
		{
			/* 8. Wait for EV7 */
			/* EV7: RxNE=1 cleared by reading DR register */
			while(!(I2C_Get_FlagStatus(I2Cx, RXNE)));

			/* 9. Read the data in the DR register */
			*pRxData = I2Cx->DR;

			/* 10. Go to next address */
			pRxData++;
		}

	}

	/* 11. After getting all data received send non ACK , to stop it */
	/* To generate the non-acknowledge pulse after the last received data byte, the ACK bit
		must be cleared just after reading the second last data byte (after second last RxNE
		event).
	 */
	/* Send ---- > NACK */
	I2C_ACKConfig(I2Cx, Disable);

	/* 12. Send Stop Condition */
	if(Stop == With_STOP)
	{
		I2C_Stop(I2Cx, Enable);
	}


	/* 8. Wait for EV7 */
	/* EV7: RxNE=1 cleared by reading DR register */
	while(!(I2C_Get_FlagStatus(I2Cx, RXNE)));

	/* 9. Read the data in the DR register */
	*pRxData = I2Cx->DR;



	/* 13. Re-Enable the automatic ACK */
	if(G_I2C_Config[index].ACK_Control == I2C_ACK_CONTROL_ENABLE)
		I2C_ACKConfig(I2Cx, Enable);
	else
		I2C_ACKConfig(I2Cx, Disable);
}

/* ================================================================
 * @Fn 				- MCAL_I2C_Slave_TX
 * @brief 			- Slave send data to master using interrupt mechanism
 * @param [in] 		- I2Cx : where x can be (1..2 depending on device used) to select I2C peripheral
 * @param [in] 		- TxData : slave data to be sent to master
 * @retval 			- None
 * Note 			- Support interrupt mechanism only
 */
void MCAL_I2C_Slave_TX(I2C_REG_t *I2Cx, uint8_t TxData)
{
	I2Cx->DR = TxData;
}

/* ================================================================
 * @Fn 				- MCAL_I2C_Slave_RX
 * @brief 			- Slave Receive data from master using interrupt mechanism
 * @param [in] 		- I2Cx : where x can be (1..2 depending on device used) to select I2C peripheral
 * @retval 			- Received data
 * Note 			- Support interrupt mechanism only
 *
 */
uint8_t MCAL_I2C_Slave_RX(I2C_REG_t *I2Cx)
{
	return (I2Cx->DR);
}


/* ================================================================ */
/* ======================== Generic APIs ========================== */
/* ================================================================ */


I2C_Flagstatus I2C_Get_FlagStatus(I2C_REG_t *I2Cx, Status Flag)
{
	//vuint32_t Dummy_Read = 0; // Volatile for compiler optimization
	uint32_t Flag_1 = 0, Flag_2 = 0, Last_Event;
	I2C_Flagstatus Bit_Status = RESET;

	switch (Flag)
	{
	case BUS_BUSY:
	{
		/*  Bit 1 BUSY: Bus busy
				0: No communication on the bus
				1: Communication ongoing on the bus
				– Set by hardware on detection of SDA or SCL low
				– cleared by hardware on detection of a Stop condition.
				It indicates a communication in progress on the bus. This information is still updated when the interface is disabled (PE=0).
		 */
		if((I2Cx->SR2) & (I2C_SR2_BUSY))
			Bit_Status = SET;
		else
			Bit_Status = RESET;
		break;
	}

	case SB:
	{
		/*
		 * Bit 0 SB: Start bit (Master mode)
					0: No Start condition
					1: Start condition generated.
			   – Set when a Start condition generated.
			   – Cleared by software by reading the SR1 register followed by writing the DR register, or by hardware when PE=0
		 */
		if((I2Cx->SR1) & (I2C_SR1_SB))
			Bit_Status = SET;
		else
			Bit_Status = RESET;
		break;
	}

	case ADDR:
	{
		/*
		 * 	Bit 1 ADDR: Address sent (master mode)/matched (slave mode)
				This bit is cleared by software reading SR1 register followed reading SR2, or by hardware when PE=0.

				Address matched (Slave)
				0: Address mismatched or not received.
				1: Received address matched.
				– Set by hardware as soon as the received slave address matched with the OAR registers
				content or a general call (when enabled depending on configuration).
				Note: In slave mode, it is recommended to perform the complete clearing sequence (READ
				SR1 then READ SR2) after ADDR is set.

				Address sent (Master)
				0: No end of address transmission
				1: End of address transmission
				– For 10-bit addressing, the bit is set after the ACK of the 2nd byte.
				– For 7-bit addressing, the bit is set after the ACK of the byte.

				Note: ADDR is not set after a NACK reception
		 */
		if((I2Cx->SR1) & (I2C_SR1_ADDR))
			Bit_Status = SET;
		else
			Bit_Status = RESET;

		/* This bit is cleared by software reading SR1 register followed reading SR2, or by hardware when PE=0. */
		//Dummy_Read = I2Cx->SR2;
		break;
	}

	case TXE:
	{
		/*
		 *  Bit 7 TxE: Data register empty (transmitters)
				0: Data register not empty
				1: Data register empty
				– Set when DR is empty in transmission. TxE is not set during address phase.
				– Cleared by software writing to the DR register or by hardware after a start or a stop condition or when PE=0.
				TxE is not set if either a NACK is received, or if next byte to be transmitted is PEC (PEC=1)
				Note: TxE is not cleared by writing the first data being transmitted, or by writing data when
				BTF is set, as in both cases the data register is still empty.
		 */
		if((I2Cx->SR1) & (I2C_SR1_TXE))
			Bit_Status = SET;
		else
			Bit_Status = RESET;
		break;
	}

	case RXNE :
	{
		/*
		 *  Bit 6 RxNE: Data register not empty (receivers)
				0: Data register empty
				1: Data register not empty
				– Set when data register is not empty in receiver mode. RxNE is not set during address phase.
				– Cleared by software reading or writing the DR register or by hardware when PE=0.
				RxNE is not set in case of ARLO event.
				Note: RxNE is not cleared by reading data when BTF is set, as the data register is still full.
		 */
		if((I2Cx->SR1) & (I2C_SR1_RXNE))
			Bit_Status = SET;
		else
			Bit_Status = RESET;
		break;
	}

	case Master_Transmitter_Event :
	{
		/* Check if BUSY ,TRA ,MSL W,TXE flags are all set */

		/*Read the I2C status register */
		Flag_1 = Master_Transmitter_Event & (0x0000FFFF);
		Flag_2 = Master_Transmitter_Event >> 16;

		/* Get the last event value form the I2C status register */
		Last_Event = ((I2Cx->SR1 & Flag_1) | ((I2Cx->SR2 & Flag_2) << 16) );

		if(Last_Event == Flag)
			Bit_Status = SET;
		else
			Bit_Status = RESET;
		break;
	}

	default:
		break;
	}
	return Bit_Status;
}

